УТ_для_edt/src/Catalogs/смартПравилаДанныхКонструктора/смартПравилаДанныхКонструктора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартПравилаДанныхКонструктора</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НазначениеДанных</name>
    <type>
      <types>CatalogRef.смартНазначениеДанныхКонструктора</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОборудования</name>
    <type>
      <types>CatalogRef.смартВидыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартПравилаДанныхКонструктора/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон("%1, %2, %3", Данные.НазначениеДанных, Данные.ВидОборудования, Данные.Комментарий);
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("НазначениеДанных");
	Поля.Добавить("ВидОборудования");
	Поля.Добавить("Комментарий");
	
КонецПроцедуры

#КонецОбласти

#Область Интерфейс

Функция ПолучитьДанныеПоПравилам(НазначениеДанных, КонструкторОборудования, ВидОборудования = Неопределено, ВернутьВсеПодходящие = Ложь) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	смартПравилаДанныхКонструктора.Отбор КАК Отбор,
	|	смартПравилаДанныхКонструктора.Значение КАК Значение,
	|	смартПравилаДанныхКонструктора.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.смартПравилаДанныхКонструктора КАК смартПравилаДанныхКонструктора
	|ГДЕ
	|	смартПравилаДанныхКонструктора.НазначениеДанных = &НазначениеДанных
	|	И смартПравилаДанныхКонструктора.ВидОборудования = &ВидОборудования
	|	И смартПравилаДанныхКонструктора.Использовать
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартПравилаДанныхКонструктора.НомерПоПорядку";
	
	Если НЕ ЗначениеЗаполнено(ВидОборудования) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И смартПравилаДанныхКонструктора.ВидОборудования = &ВидОборудования", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НазначениеДанных", НазначениеДанных);
	Запрос.УстановитьПараметр("ВидОборудования", ВидОборудования);
	
	СхемаКомпоновкиДанных = Справочники.смартПравилаДанныхКонструктора.ПолучитьМакет("УсловияКонструкторОборудования");
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных));
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НастройкиКомпоновки = Выборка.Отбор.Получить();
		Если НастройкиКомпоновки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновки);
		Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонструкторОборудования");
		Параметр.Использование = Истина;
		Параметр.Значение = КонструкторОборудования;
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,, Истина);
		
		ТаблицаРезультата = Новый ТаблицаЗначений;
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
		Если ТаблицаРезультата.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ВернутьВсеПодходящие Тогда
			Возврат Выборка.Значение;
		Иначе
			Результат.Добавить(Выборка.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ВернутьВсеПодходящие Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПоследнийНомерПоПорядку(НазначениеДанных, ВидОборудования) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(смартПравилаДанныхКонструктора.НомерПоПорядку) КАК НомерПоПорядку
	|ИЗ
	|	Справочник.смартПравилаДанныхКонструктора КАК смартПравилаДанныхКонструктора
	|ГДЕ
	|	смартПравилаДанныхКонструктора.НазначениеДанных = &НазначениеДанных
	|	И смартПравилаДанныхКонструктора.ВидОборудования = &ВидОборудования";
	
	Запрос.УстановитьПараметр("НазначениеДанных", НазначениеДанных);
	Запрос.УстановитьПараметр("ВидОборудования", ВидОборудования);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерПоПорядку;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти
